/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "No s'ha pogut completar l'operació.";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Hi ha hagut un error desconegut (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "No s'ha pogut completar l'acció";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Proveu-ho de nou més tard.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "No es pot enregistrar";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "No es pot enregistrar";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Atureu qualsevol altre acció amb el %@ i proveu-ho de nou."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "No es pot enregistrar";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operació aturada";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "No hi ha prou espai disponible per continuar escrivint arxius. Allibereu espai eliminant vídeos o fotos existents.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "S'ha arribat a la durada màxima per a aquest enregistrament."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "S'ha arribat a la mida màxima per a aquest enregistrament."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Atureu qualsevol altre acció que usi el dispositiu d'enregistrament i proveu-ho de nou.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "S'ha arribat a la durada màxima per a aquest enregistrament."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "No es pot enregistrar";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Proveu d'enregistrar de nou.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "No es pot usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Atureu qualsevol altre acció amb el %@ i proveu-ho de nou."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "No es pot usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Atureu qualsevol altre acció amb el %@ i proveu-ho de nou."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Enregistrament aturat";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Atureu qualsevol altre acció que usi el dispositiu d'enregistrament i proveu-ho de nou.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "No s'ha pogut completar l'acció";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Proveu-ho de nou més tard.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "No s'ha pogut exportar completament";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Proveu d'exportar de nou.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "No es pot descodificar";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "No s'han pogut descodificar les dades multimèdia. Poden estar malmeses.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "El format d’aquest contingut multimèdia no és compatible.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "No es pot desar";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Proveu de desar de nou.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Aquest ítem multimèdia no es pot usar.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Aquest ítem multimèdia no es pot usar.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Aquest ítem multimèdia no es pot usar.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Aquest ítem multimèdia no es pot usar.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "El format d’aquest contingut multimèdia no és compatible.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Aquest contingut multimèdia pot estar malmès.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "No es pot fer foto";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Proveu de tornar a fer la foto.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operació aturada";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "No es pot efectuar aquesta operació amb contingut protegit."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Aquest contingut no està autoritzat."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Aquesta aplicació no està autoritzada a reproduir aquest fitxer."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Aquest ítem multimèdia no es pot usar.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "No es pot descodificar";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "No s'ha trobat el descodificador necessari per a aquest contingut multimèdia.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "No es pot codificar";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "No s'ha trobat el codificador necessari per a aquest contingut multimèdia.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "No es pot descodificar";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "El descodificador necessari per a aquest contingut multimèdia està en ús.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Atureu qualsevol altre acció de descodificació de contingut multimèdia i proveu-ho de nou.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "No es pot codificar";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "El codificador necessari per a aquest contingut multimèdia està en ús.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Atureu qualsevol altre acció de codificació de contingut multimèdia i proveu-ho de nou.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "No es pot usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Una aplicació executada en segon pla no pot usar %@."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operació aturada";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "No es pot efectuar aquesta operació amb aquest contingut.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operació aturada";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "No s'ha pogut composar el vídeo d'acord amb les instruccions proveïdes.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "No es pot obrir";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Aquest ítem multimèdia no es pot usar.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operació aturada";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "No es pot usar l'arxiu de la memòria cau desat a l'URL de destinació de les descàrregues.";
